app/controllers/public/homes_controller.rb

SELECT  "items".* FROM "items" ORDER BY "items"."created_at" DESC LIMIT ?  [["LIMIT", 4]]
---
  def top
    @items = Item.order(created_at: :desc).limit(4)